//
//  ViewController.swift
//  Apple Pie
//
//  Created by Alexwrom on 19.04.2021.
//

import UIKit

class ViewController: UIViewController {
    
    // MARK: - IB Outlets
    @IBOutlet weak var image: UIImageView!
    @IBOutlet var letteralsButtons: [UIButton]!
    @IBOutlet weak var textLabel: UILabel!
    @IBOutlet weak var scoreLabel: UILabel!
    
    // MARK: - Properties
    var currentGame : Game!
    let incorrectAllowed = 7
    var statesCapital = [
        "Вена",
        "Баку",
        "Нассау",
        "Манама",
        "Дакка",
        "Бриджтаун",
        "Минск",
        "Брюссель",
        "Бельмопан",
        "Порто-Ново",
        "Тхимпху",
        "Сукре",
        "Сараево",
        "Габороне",
        "Бразилиа",
        "Бандар-Сери-Багаван",
        "София",
        "Уагадугу",
        "Бужумбура",
        "Пномпень",
        "Яунде",
        "Оттава",
        "Прая",
        "Банги",
        "Нджамена",
        "Сантьяго",
        "Пекин",
        "Санта-Фе-де-Богота",
        "Морони",
        "Браззавиль",
        "Киншаса",
        "Сан-Хосе",
        "Ямусукро",
        "Загреб",
        "Гавана",
        "Никосия",
        "Прага",
        "Копенгаген",
        "Джибути",
        "Розо",
        "Санто-Доминго",
        "Дили",
        "Кито",
        "Каир",
        "Сан-Сальвадор",
        "Малабо",
        "Асмэра",
        "Таллин",
        "Аддис-Абеба",
        "Сува",
        "Хельсинки",
        "Париж",
        "Либревиль",
        "Банжул",
        "Тбилиси",
        "Берлин",
        "Аккра",
        "Афины",
        "Сент-Джорджес",
        "Гватемала",
        "Бисау",
        "Конакри",
        "Джорджтаун",
        "Порт-о-Пренс",
        "Тегусигальпа",
        "Будапешт",
        "Рейкьявик",
        "Нью-Дели",
        "Джакарта",
        "Тегеран",
        "Багдад",
        "Дублин",
        "Иерусалим",
        "Рим",
        "Кингстон",
        "Токио",
        "Амман",
        "Астана",
        "Найроби",
        "Южная Тарава",
        "Пхеньян",
        "Сеул",
        "Эль-Кувейт",
        "Бишкек",
        "Вьентьян",
        "Рига",
        "Бейрут",
        "Масеру",
        "Монровия",
        "Триполи",
        "Вадуц",
        "Вильнюс",
        "Люксембург",
        "Скопье",
        "Антананариву",
        "Лилонгве",
        "Куала-Лумпур",
        "Мале",
        "Бамако",
        "Валлетта",
        "Маджуро",
        "Нуакшот",
        "Порт-Луи",
        "Мехико",
        "Паликир",
        "Кишинев",
        "Монако",
        "Улан-Батор",
        "Подгорица",
        "Рабат",
        "Мапуту",
        "Найпьидо",
        "Виндхук",
        "официальной столицы не имеет",
        "Катманду",
        "Амстердам",
        "Веллингтон",
        "Манагуа",
        "Ниамей",
        "Абуджа",
        "Осло",
        "Маскат",
        "Исламабад",
        "Мелекеок",
        "Панама",
        "Порт-Морсби",
        "Асунсьон",
        "Лима",
        "Манила",
        "Варшава",
        "Лиссабон",
        "Доха",
        "Бухарест",
        "Москва",
        "Кигали",
        "Бастер",
        "Кастри",
        "Кингстаун",
        "Апиа",
        "Сан-Марино",
        "Сан-Томе",
        "Эр-Рияд",
        "Дакар",
        "Белград",
        "Виктория",
        "Фритаун",
        "Сингапур",
        "Братислава",
        "Любляна",
        "Хониара",
        "Могадишо",
        "Претория",
        "Мадрид",
        "Коломбо",
        "Хартум",
        "Парамарибо",
        "Мбабане",
        "Стокгольм",
        "Берн",
        "Дамаск",
        "Душанбе",
        "Додома",
        "Бангкок",
        "Ломе",
        "Нукуалофа",
        "Порт-оф-Спейн",
        "Тунис",
        "Анкара",
        "Ашхабад",
        "Фунафути",
        "Кампала",
        "Киев",
        "Абу-Даби",
        "Лондон",
        "Вашингтон",
        "Монтевидео",
        "Ташкент",
        "Порт-Вила",
        "Ватикан",
        "Каракас",
        "Ханой",
        "Сана",
        "Лусака",
        "Хараре",
    ]
    var totalWins = 0
    var totalLosses = 0
    
    override func viewDidLoad() {
        super.viewDidLoad()
        newRound()
    }

    // MARK: - IB Actions
    
    @IBAction func clickButton(_ sender: UIButton) {
        sender.isEnabled = false
        let letter = sender.title(for: .normal)!
        currentGame.playerGussed(letter: Character(letter))
        updateUI()
        
    }
    
    func newRound(){
        let newWord = statesCapital.removeFirst()
        currentGame = Game(word: newWord, incorrectMoves: incorrectAllowed)
        updateUI()
    }
    
    func updateUI(){
        let fileName = "View\(8 - currentGame.incorrectMoves)"
        image.image = UIImage(named: fileName)
        scoreLabel.text = "Score:Wins - \(totalWins), Losses - \(totalLosses)"
    }
    
}

